app/controllers/dashboard/admin_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_admins
      @admins = Admin.find(params[:id])