app/views/home/index.html.erb

SELECT  "proposals".* FROM "proposals"  ORDER BY "proposals"."id" ASC LIMIT 1
---
                <tbody>
                  <% @proposal.proposal_roles.each do |proposal_role| %>