app/controllers/equipaments_controller.rb

SELECT "equipaments".* FROM "equipaments"
---
	def index
		@equipaments = Equipament.all