app/controllers/home_controller.rb

SELECT  "calculations".* FROM "calculations"  ORDER BY "calculations"."id" ASC LIMIT 1
SELECT  "proposals".* FROM "proposals"  ORDER BY "proposals"."id" ASC LIMIT 1
---
  def index
  	@select_all_calculation = Calculation.first
  	@proposal = Proposal.first