app/controllers/proposals_controller.rb

  def index
    select_service
    @admins = policy_scope(Admin)
    if  current_admin.full_access? || current_admin.partial_access?
      @proposals = Proposal.all.page(params[:page])
---
SELECT  "proposals".* FROM "proposals" LIMIT 25 OFFSET 0